{
    "nav": {
        "home": "Inicio",
        "resume": "Resumen",
        "services": "Servicios",
        "portfolio": "Portafolio",
        "contact": "Contacto"
    },
    "header": {
        "title": "NITE",
        "subtitle": "Desarrollador/Diseñador Front-End | Desarrollador de Juegos | Diseñador UX/UI"
    },
    "about": {
        "who": "¿Quién soy?",
        "located": "Diseñador/Desarrollador Web ubicado en Ecuador",
        "goal": "Mi principal objetivo profesional es ofrecer soluciones de la más alta calidad.",
        "download": "Descargar mi CV",
        "personal": "Información Personal",
        "expertise": "Mi Experiencia",
        "ux": "Diseño UX",
        "uxsub": "Interacción, simplicidad, intuición.",
        "web": "Desarrollo Web",
        "websub": "Sitios Web, Aplicaciones Web, Aplicaciones Móviles.",
        "game": "Desarrollo de Videojuegos",
        "gamesub": "Desarrollo, diseño de niveles y arte de videojuegos."
    },
    "resume": {
        "title": "Mateo Bonilla | Currículum",
        "name": "Mateo Bonilla",
        "subtitle": "Desarrollador/Diseñador Front-End | Desarrollador de Juegos | Diseñador UX/UI",
        "brandSubtitle": "Diseñador Web | Desarrollador de Juegos | Diseñador Gráfico",
        "my": "Mi",
        "titleSection": "Currículum",
        "expertise": "Experiencia",
        "frontendTitle": "Desarrollador Front-End",
        "frontendDesc": "Experto en crear interfaces web responsivas y fáciles de usar con frameworks modernos como React y Angular. Habilidades en HTML, CSS y JavaScript. Enfoque en accesibilidad, rendimiento y experiencia de usuario fluida.",
        "gameTitle": "Desarrollo de Videojuegos",
        "gameDesc": "Experiencia en programación de mecánicas de juego y sistemas interactivos en Unity (C#). Capacidad para diseñar interfaces intuitivas y sistemas de retroalimentación para el jugador.",
        "uxTitle": "Diseñador UX",
        "uxDesc": "Diseñador UX/UI para aplicaciones web, móviles y videojuegos. Creación de experiencias intuitivas y responsivas.",
        "education": "Educación",
        "degree": "Licenciatura en Diseño Interactivo",
        "degreeDesc": "Especializado en diseño UX y programación para web, apps y videojuegos.",
        "minor": "Minor en Diseño de Comunicación",
        "minorDesc": "Experiencia en fotografía, Adobe Design y diseño gráfico, con enfoque en comunicación visual.",
        "highschool": "Título de Bachiller",
        "highschoolDesc": "Base sólida en pensamiento analítico, resolución de problemas y habilidades técnicas.",
        "skills": "Habilidades",
        "languages": "Idiomas"
    },
    "services": {
        "title": "Mateo Bonilla | Servicios",
        "name": "Mateo Bonilla",
        "subtitle": "Desarrollador Front-End | Desarrollador de Juegos | Diseñador Gráfico",
        "brandSubtitle": "Diseñador Web | Desarrollador de Juegos | Diseñador Gráfico",
        "my": "Mis",
        "titleSection": "Servicios",
        "webTitle": "Diseño Web",
        "webDesc": "Diseño de sitios web personalizados, desarrollo front-end y back-end, diseño UX/UI y optimización del rendimiento. Incluye soluciones de comercio electrónico, diseño adaptable a móviles y mantenimiento continuo para seguridad y gestión de contenido.",
        "gameTitle": "Desarrollo de Videojuegos",
        "gameDesc": "Diseño conceptual, programación de mecánicas y IA, modelado 3D, animación e integración de sonido. Incluye pruebas de calidad, optimización de rendimiento y publicación para distribución y marketing.",
        "appTitle": "Desarrollo de Aplicaciones",
        "appDesc": "Diseño UI/UX, programación para Android y multiplataforma, integración de API y configuración de bases de datos. Incluye pruebas, monitoreo de rendimiento y mantenimiento a largo plazo para seguridad y compatibilidad.",
        "graphicTitle": "Comunicación Gráfica",
        "graphicDesc": "Creación de identidad visual (logos, manuales de marca), diseño publicitario (anuncios, banners), diseño de empaques, infografías y materiales promocionales para plataformas digitales e impresas.",
        "videoTitle": "Edición de Video",
        "videoDesc": "Edición y montaje de video, corrección de color, gráficos animados, diseño de sonido y optimización de formatos para diferentes plataformas y propósitos.",
        "uxTitle": "Diseño UX",
        "uxDesc": "Investigación de usuarios, wireframes, prototipos, arquitectura de información, diseño de interfaces y pruebas de usabilidad para garantizar experiencias intuitivas y fluidas.",
        "freelance": "Disponible para trabajo freelance",
        "hire": "Contrátame"
    },
    "portfolio": {
        "title": "Mateo Bonilla | Portafolio",
        "name": "NITE",
        "subtitle": "Desarrollador Front-End | Desarrollador de Juegos | Diseñador Gráfico",
        "brandSubtitle": "Diseñador Web | Desarrollador de Juegos | Diseñador Gráfico",
        "my": "Mi",
        "titleSection": "Portafolio",
        "filter": {
            "new": "Nuevos",
            "game": "Juegos",
            "web": "Web/Apps",
            "ux": "UX/UI",
            "design": "Diseño"
        },
        "selectDescription": "Selecciona una categoría para ver su descripción...",
        "descNew": "Los proyectos más recientes añadidos a este portafolio, que abarcan diversas áreas de trabajo.",
        "descGame": "Proyectos desarrollados en Unity y otros motores, centrados en jugabilidad, arte y narrativa.",
        "descWeb": "Aplicaciones web y móviles que muestran experiencia en diseño UX y desarrollo front-end.",
        "descUx": "Proyectos enfocados en diseño UX/UI, prototipado y wireframing.",
        "descDesign": "Proyectos de diseño gráfico, branding, animación y fotografía que exploran la creatividad visual."
    },
    "contact": {
        "title": "Mateo Bonilla | Contacto",
        "name": "Mateo Bonilla",
        "subtitle": "Desarrollador Front-End | Desarrollador de Juegos | Diseñador Gráfico",
        "brandSubtitle": "Diseñador Web | Desarrollador de Juegos | Diseñador Gráfico",
        "formTitle": "Enviar un Mensaje",
        "namePlaceholder": "Nombre *",
        "emailPlaceholder": "Correo electrónico *",
        "messagePlaceholder": "Mensaje *",
        "sendBtn": "Enviar Mensaje",
        "getInTouch": "Ponte en Contacto",
        "phone": "Teléfono:",
        "country": "País:",
        "email": "Correo:",
        "modal": {
            "title": "¡Mensaje Enviado!",
            "text": "Tu mensaje ha sido enviado correctamente. Me pondré en contacto contigo pronto.",
            "close": "Cerrar"
        }
    },
    "fragment": {
        "title": "Fragmento | Mateo Bonilla",
        "projectTitle": "Fragment - Metroidvania",
        "categoryTitle": "CATEGORÍA",
        "category1": "Desarrollo de Videojuegos",
        "category2": "Diseño UX/UI",
        "category3": "Narrativa",
        "yearTitle": "AÑO",
        "clientTitle": "CLIENTE",
        "client": "Juego Independiente",
        "description1": "Fragment es un metroidvania inspirado en la temática de la esquizofrenia. El jugador avanza para descubrir la historia mientras interactúa con diversos personajes que desafían su identidad y revelan quién es realmente.",
        "description2": "Tecnologías y herramientas",
        "video": "Video Promocional",
        "menu": "Menú",
        "pause": "Menú de Pausa",
        "gameover": "Menú de Game Over",
        "projects": "Proyectos",
        "objectivesTitle": "Objetivos del proyecto",
        "objective1": {
            "title": "Propuesta",
            "item1": "Dar a conocer una enfermedad tabú.",
            "item2": "Crear un proyecto que visibilice la enfermedad.",
            "item3": "Crear conciencia de que en ocasiones se puede llevar una vida normal."
        },
        "objective2": {
            "title": "Investigación",
            "item1": "Identificar las barreras de conocimiento sobre la enfermedad.",
            "item2": "Conocer el nivel de entendimiento de algunos casos.",
            "item3": "Explorar qué tanto conocen las personas sobre enfermedades mentales."
        },
        "objective3": {
            "title": "Producto",
            "item1": "Diseñar un videojuego que dé visibilidad a enfermedades mentales.",
            "item2": "Crear un gameplay centrado en la enfermedad como personaje principal.",
            "item3": "Integrar concienciación, visibilidad y entretenimiento en un solo producto."
        },
        "designProcessTitle": "Proceso de Diseño",
        "researchTitle": "Investigación",
        "keyFindingsTitle": "Hallazgos clave",
        "keyFinding1": "Falta de información sobre las enfermedades mentales.",
        "keyFinding2": "Tabú o rechazo hacia las personas con este tipo de problemas.",
        "keyFinding3": "Falta de entendimiento o comprensión hacia estas condiciones.",
        "methodologyTitle": "Metodología",
        "methodology": "VIEDU",
        "stat1": "Respuestas en encuesta cuantitativa",
        "stat2": "Entrevistas con usuarios reales",
        "stat3": "Usuarios que probaron el demo",
        "definitionTitle": "Definición",
        "projectTitle2": "El Proyecto",
        "projectItem1": "Tiene un enfoque narrativo en 2D, donde el jugador asume el rol de un protagonista con esquizofrenia.",
        "projectItem2": "El objetivo principal es distinguir qué es realmente real.",
        "ideationTitle": "Ideación",
        "storyTitle": "Tema e Historia",
        "storyItem1": "El tema principal es la aceptación interna de la esquizofrenia y la búsqueda del equilibrio mental.",
        "storyItem2": "El mundo representa cómo percibe la realidad el personaje principal.",
        "designTitle": "Diseño",
        "designItem1": "En la fase de diseño, traduje lo definido en soluciones visuales y funcionales mediante wireframes y un prototipo interactivo.",
        "sketchTitle": "Boceto",
        "sketchDescription": "Boceto del diseño de nivel y sus posibles elementos interactivos.",
        "prototypeTitle": "Prototipo",
        "resultsTitle": "Resultados",
        "resultsDescription": "Una experiencia digital que permite a cualquier persona concienciarse sobre este tipo de enfermedades mentales, aprender, explorar e interactuar sin intimidación. El juego integra mecánicas, educación gradual y visibilidad, presentando estos temas de una forma accesible, atractiva y entretenida.",
        "resultItem1": "Demo completo del primer nivel del videojuego, con jugabilidad, interacción e historia.",
        "resultItem2": "Narrativa integrada dentro de los personajes secundarios (NPCs).",
        "resultItem3": "Mecánicas reales basadas en enfermedades mentales.",
        "challengesTitle": "Retos y Aprendizajes",
        "challengesDescription": "Este proyecto fue tanto gratificante como desafiante. A lo largo del proceso fue enriquecedor ver cómo una idea inicial tomó forma y evolucionó con cada iteración. Observar cómo la investigación, el diseño y el desarrollo se integran para dar vida a una solución real me ayudó a fortalecer mis habilidades, aplicar empatía, resiliencia y confiar en el proceso creativo.",
        "challengeItem1": "El contexto de las enfermedades mentales, aunque desafiante, puede generar ideas de diseño interesantes.",
        "challengeItem2": "Implementar afecciones mentales en mecánicas jugables fue realmente difícil pero divertido.",
        "challengeItem3": "Aprendí a plasmar ideas y diseños en código funcional.",
        "nextStepsTitle": "Próximos Pasos",
        "nextStep1": "Crear un videojuego completo que profundice más en este tipo de enfermedades.",
        "nextStep2": "Lanzamiento en tiendas de videojuegos como Steam o Play Store.",
        "nextStep3": "Crear una comunidad que genere mayor visibilidad para este tipo de proyectos."
    },
    "bg": {
        "title": "Banco Guayaquil | Desafío de Diseño",
        "projectTitle": "BG Design Challenge",
        "categoryTitle": "CATEGORÍA",
        "category1": "Diseño UX/UI",
        "category2": "Prototipado",
        "yearTitle": "AÑO",
        "clientTitle": "CLIENTE",
        "client": "Banco Guayaquil",
        "description1": "Diseño y prototipado de un flujo de solicitud de tarjeta de crédito para la aplicación móvil de Banco Guayaquil, enfocado en mejorar la accesibilidad y reducir la fricción del usuario. El flujo admite tanto a usuarios actuales de la app como a nuevos clientes.",
        "description2": "Tecnología y Herramientas: Figma (Diseño y Prototipado).",
        "viewProject": "Ver Prototipo",
        "objectivesTitle": "Objetivos del Proyecto",
        "objective1": {
            "title": "Propuesta",
            "item1": "Simplificar el proceso de solicitud de tarjetas de crédito.",
            "item2": "Mejorar la accesibilidad del usuario dentro del ecosistema bancario.",
            "item3": "Proporcionar una experiencia fluida para nuevos y actuales clientes."
        },
        "objective2": {
            "title": "Investigación",
            "item1": "Analizar los puntos de dolor de los usuarios en los flujos tradicionales de solicitud.",
            "item2": "Identificar brechas y oportunidades de mejora en la experiencia de usuario.",
            "item3": "Recopilar información cualitativa de usuarios de banca móvil."
        },
        "objective3": {
            "title": "Producto",
            "item1": "Diseñar un flujo digital intuitivo y paso a paso para solicitar tarjetas de crédito.",
            "item2": "Integrar consistencia visual acorde con la identidad de Banco Guayaquil.",
            "item3": "Desarrollar un prototipo interactivo para pruebas de usabilidad."
        },
        "designProcessTitle": "Proceso de Diseño",
        "researchTitle": "Investigación",
        "keyFindingsTitle": "Hallazgos Clave",
        "keyFinding1": "Procesos complicados para solicitar una tarjeta de crédito.",
        "keyFinding2": "Falta de facilidad para aquellos que no son clientes de Banco Guayaquil.",
        "keyFinding3": "Proceso disponible únicamente por la web.",
        "methodologyTitle": "Metodología",
        "methodology": "Design System",
        "stat1": "Respuestas en encuesta cuantitativa",
        "stat2": "Entrevistas con usuarios reales",
        "stat3": "Usuarios que probaron el prototipo",
        "definitionTitle": "Definición",
        "projectTitle2": "El Proyecto",
        "projectItem1": "El principal objetivo del rediseño es crear una nueva funcionalidad en la aplicación móvil para facilitar el trámite de las tarjetas de crédito.",
        "projectItem2": "Se debe considerar que la nueva funcionalidad sea útil tanto para clientes como para no clientes de Banco Guayaquil.",
        "ideationTitle": "Ideación",
        "storyTitle": "Concepto",
        "storyItem1": "Facilidad, intuición y diseño amigable.",
        "prototypeTitle": "Prototipo",
        "workflowTitle": "Diseño del Flujo",
        "workflowSubtitle": "Flujo de Solicitud",
        "resultsTitle": "Resultados",
        "resultsDescription": "El prototipo final ofrece un proceso de solicitud más rápido e intuitivo. Mediante claridad visual, entradas simplificadas y retroalimentación coherente, el diseño mejora la usabilidad y accesibilidad para todos los usuarios.",
        "resultItem1": "Incremento del 30% en la velocidad de finalización de tareas (según pruebas).",
        "resultItem2": "Mayor percepción de confianza mediante jerarquía visual y espaciado.",
        "resultItem3": "Prototipo validado con pruebas de usuario y ciclos de iteración en Figma.",
        "challengesTitle": "Retos y Aprendizajes",
        "challengesDescription": "Crear una experiencia financiera centrada en el usuario fue tanto desafiante como gratificante. Equilibrar la simplicidad con la confianza y garantizar accesibilidad para todos los usuarios requirió iteraciones y análisis de retroalimentación cuidadosos.",
        "nextStepsTitle": "Próximos Pasos",
        "nextStep1": "Realizar pruebas A/B con usuarios reales para optimizar el rendimiento del flujo.",
        "nextStep2": "Extender el sistema de diseño a otros flujos de producto (créditos, cuentas).",
        "nextStep3": "Colaborar con el equipo de desarrollo para la implementación en la app móvil de Banco Guayaquil.",
        "projects": "Proyectos"
    },
    "dlc": {
        "title": "DLC | Mateo Bonilla",
        "projectTitle": "Dragon Learning Center (DLC)",
        "categoryTitle": "CATEGORY",
        "category1": "App Development",
        "category2": "UX/UI Design",
        "category3": "Mobile",
        "yearTitle": "YEAR",
        "clientTitle": "CLIENT",
        "client": "USFQ (Universidad San Francisco de Quito)",
        "description1": "Dragon Learning Center is a mobile application designed for USFQ students to schedule tutoring sessions in specific subjects. Users can register as tutors or students, check availability, and easily book appointments.",
        "description2": "Tech stack: Angular, Ionic Framework, TypeScript, SCSS, JavaScript, HTML5, Firebase (backend), Figma, and Adobe Illustrator (design & prototyping).",
        "viewLink": "View on Play Store",
        "toolsTitle": "Tech & Tools",
        "demoTitle": "Demo Video",
        "mobileTitle": "Mobile Interface",
        "resultsTitle": "Results",
        "resultsDescription": "The app successfully streamlined the tutoring process for USFQ students, improving accessibility, usability, and interaction between tutors and learners. Its intuitive design enhanced engagement and academic collaboration.",
        "result1": "Students can schedule and track sessions directly from their phones.",
        "result2": "Tutors can manage availability and subjects in real time.",
        "result3": "The app encourages collaborative learning through an easy-to-use interface.",
        "challengesTitle": "Challenges & Learnings",
        "challengesDescription": "Developing a mobile app for academic use was a challenge in balancing usability, scalability, and accessibility. The project reinforced my skills in component-based design, responsive interfaces, and effective user feedback integration.",
        "challenge1": "Integrating Firebase authentication and real-time scheduling.",
        "challenge2": "Designing for both students and tutors with different needs.",
        "challenge3": "Ensuring smooth performance on Android and iOS devices.",
        "nextStepsTitle": "Next Steps",
        "next1": "Implement notifications and reminders for sessions.",
        "next2": "Add analytics to track academic improvement.",
        "next3": "Expand to a web platform for broader accessibility.",
        "projects": "Proyectos",
        "objectivesTitle": "Objetivos del Proyecto",
        "objective1Title": "Accesibilidad",
        "objective1Item1": "Permitir que los estudiantes agenden tutorías fácilmente mediante una interfaz móvil amigable.",
        "objective1Item2": "Asegurar que todos los usuarios puedan acceder a la app sin importar el dispositivo o nivel técnico.",
        "objective2Title": "Eficiencia",
        "objective2Item1": "Simplificar el proceso de conexión entre tutores y estudiantes.",
        "objective2Item2": "Automatizar la programación y notificaciones para ambos roles.",
        "objective3Title": "Comunidad",
        "objective3Item1": "Fomentar la colaboración académica y el aprendizaje entre pares dentro de la universidad.",
        "objective3Item2": "Crear un sistema confiable donde los tutores obtengan visibilidad y credibilidad.",
        "designProcessTitle": "Proceso de Diseño",
        "researchTitle": "Investigación",
        "keyFindingsTitle": "Hallazgos Clave",
        "keyFinding1": "Los estudiantes tenían dificultades para encontrar tutores disponibles rápidamente.",
        "keyFinding2": "La programación manual tomaba tiempo y causaba confusiones.",
        "keyFinding3": "Los usuarios querían una plataforma unificada para la gestión de tutorías.",
        "methodologyTitle": "Metodología",
        "methodology": "Design Thinking + Entrevistas con Usuarios",
        "definitionTitle": "Definición",
        "projectDefinition": "El Proyecto",
        "projectItem1": "Definir un flujo de simple e intuitivo para tutores y estudiantes.",
        "projectItem2": "Diseñar navegación clara y jerarquía visual para mejorar la accesibilidad.",
        "ideationTitle": "Ideación",
        "storyTitle": "Concepto",
        "storyItem1": "Conectar el aprendizaje y la enseñanza en una app fácil de usar.",
        "storyItem2": "Diseño centrado en claridad, pocos pasos y retroalimentación visual.",
        "designTitle": "Diseño",
        "designItem1": "Se crearon wireframes y prototipos interactivos en Figma para validar los flujos.",
        "designItem2": "Las pruebas con usuarios guiaron los ajustes de interfaz para mejorar la usabilidad y legibilidad.",
        "stat1": "Respuestas en encuesta cuantitativa",
        "stat2": "Entrevistas con usuarios reales",
        "stat3": "Usuarios que probaron la app"
    },
    "survival": {
        "title": "Survival M | Mateo Bonilla",
        "projectTitle": "Survival M – Demo de Supervivencia 3D",
        "categoryTitle": "CATEGORÍA",
        "category1": "Desarrollo de Videojuegos",
        "category2": "Diseño en Unity 3D",
        "category3": "Diseño UX/UI",
        "yearTitle": "AÑO",
        "clientTitle": "CLIENTE",
        "client": "Proyecto Personal",
        "description1": "Survival M es una demo 3D creada en Unity, inspirada en los clásicos Resident Evil. Los jugadores deben sobrevivir en una ciudad invadida por zombis, administrar recursos limitados y superar enfrentamientos intensos culminando en una batalla final.",
        "description2": "Tecnologías y herramientas: Unity (desarrollo 3D), C# (programación).",
        "videoTitle": "Video Demo",
        "objectivesTitle": "Objetivos del Proyecto",
        "objective1": {
            "title": "Propuesta",
            "item1": "Crear una demo jugable centrada en mecánicas de supervivencia y tensión.",
            "item2": "Simular la gestión de recursos y el combate bajo presión.",
            "item3": "Diseñar una experiencia visual y narrativa coherente para el jugador."
        },
        "objective2": {
            "title": "Investigación",
            "item1": "Analizar el comportamiento de los jugadores en situaciones de estrés en juegos de supervivencia.",
            "item2": "Identificar los factores que aumentan la inmersión y el compromiso."
        },
        "objective3": {
            "title": "Producto",
            "item1": "Entregar una demo corta con combate, inventario y elementos de puzzle.",
            "item2": "Integrar una batalla final para demostrar las mecánicas del juego."
        },
        "designProcessTitle": "Proceso de Diseño",
        "researchTitle": "Investigación",
        "keyFindingsTitle": "Hallazgos Clave",
        "keyFinding1": "Los jugadores prefieren controles intuitivos de combate y exploración.",
        "keyFinding2": "La iluminación y el sonido mejoran la atmósfera y la inmersión.",
        "keyFinding3": "El equilibrio en la escasez de recursos incrementa la tensión y la sensación de supervivencia.",
        "methodologyTitle": "Metodología",
        "methodology": "Diseño Iterativo de Videojuegos",
        "designTitle": "Diseño",
        "designItem1": "Durante la fase de diseño, se crearon entornos, menús y flujos UX en Figma antes de implementarlos en Unity.",
        "resultsTitle": "Resultados",
        "resultsDescription": "Una demo 3D que captura con éxito la esencia del survival horror clásico a través de un diseño inmersivo, mecánicas desafiantes y una gestión ajustada de recursos.",
        "challengesTitle": "Retos y Aprendizajes",
        "challengesDescription": "Este proyecto fue tanto desafiante como gratificante. Fue fascinante ver cómo una idea inicial evolucionó hasta convertirse en un producto jugable mediante iteraciones y pruebas. Fortalecí mis conocimientos sobre flujo de juego, equilibrio de dificultad y narrativa ambiental.",
        "challengeItem1": "Equilibrar la dificultad del juego manteniendo la tensión y la inmersión del jugador.",
        "challengeItem2": "Diseñar iluminación 3D realista para mejorar la inmersión y la atmósfera.",
        "challengeItem3": "Traducir conceptos de diseño en código funcional dentro de Unity.",
        "nextStepsTitle": "Próximos Pasos",
        "nextStep1": "Desarrollar una versión más extensa con nuevos niveles y tramas.",
        "nextStep2": "Implementar actuación de voz y efectos de sonido más inmersivos.",
        "nextStep3": "Publicar la versión completa en Steam o itch.io.",
        "projects": "Proyectos"
    },
    "bi": {
        "title": "BI Activate | Mateo Bonilla",
        "projectTitle": "BI Activate",
        "categoryTitle": "CATEGORÍA",
        "category1": "Desarrollo Web",
        "category2": "Diseño UX/UI",
        "category3": "Edición de Video",
        "yearTitle": "AÑO",
        "clientTitle": "CLIENTE",
        "client": "Banco Internacional",
        "description1": "BI Activate es un sitio web para una organización bancaria diseñado para facilitar la colaboración entre equipos. Ayuda a los empleados a descubrir iniciativas lideradas por sus compañeros (clubes, actividades y proyectos), conectarse entre sí y unirse fácilmente desde cualquier área de la empresa.",
        "description2": "El sitio está alojado en Firebase y desarrollado con HTML5, SCSS y JavaScript. Los diseños y prototipos fueron creados en Figma, y los videos promocionales se realizaron en Adobe After Effects.",
        "viewSite": "Ver el sitio web",
        "toolsTitle": "Tecnologías y Herramientas",
        "objectivesTitle": "Objetivos del Proyecto",
        "objective1": {
            "title": "Propósito",
            "item1": "Crear un espacio digital que conecte a los empleados a través de intereses y actividades internas.",
            "item2": "Fortalecer la cultura interna del Banco Internacional mediante la colaboración y el compromiso.",
            "item3": "Fomentar la participación en actividades corporativas a través de una interfaz clara y accesible."
        },
        "objective2": {
            "title": "Investigación",
            "item1": "Comprender los desafíos de comunicación entre departamentos.",
            "item2": "Identificar qué motiva a los empleados a participar en eventos y clubes internos.",
            "item3": "Recopilar datos para definir objetivos de usabilidad y prioridades de diseño."
        },
        "objective3": {
            "title": "Impacto",
            "item1": "Promover un mayor sentido de pertenencia dentro de la organización.",
            "item2": "Aumentar la visibilidad y participación en iniciativas impulsadas por la comunidad.",
            "item3": "Ofrecer una plataforma que refleje los valores de colaboración e innovación."
        },
        "designProcessTitle": "Proceso de Diseño",
        "researchTitle": "Investigación",
        "keyFindingsTitle": "Hallazgos Clave",
        "keyFinding1": "Los empleados carecían de una plataforma unificada para conectarse más allá de sus tareas diarias.",
        "keyFinding2": "Las iniciativas internas estaban poco comunicadas o eran difíciles de descubrir.",
        "keyFinding3": "Existía un alto interés en participar en clubes y eventos, pero con poca visibilidad.",
        "methodologyTitle": "Metodología",
        "methodology": "Encuestas, entrevistas y pruebas de usabilidad",
        "stat1": "Respuestas en la encuesta interna de empleados",
        "stat2": "Talleres realizados con distintos departamentos",
        "stat3": "Iteraciones de diseño antes del lanzamiento",
        "definitionTitle": "Definición",
        "projectConceptTitle": "Concepto del Proyecto",
        "projectConceptItem1": "Construir un centro digital donde los empleados puedan explorar, unirse y promover actividades internas.",
        "projectConceptItem2": "Fomentar la colaboración y el reconocimiento a través de la visibilidad de iniciativas lideradas por los empleados.",
        "projectConceptItem3": "Crear una experiencia fluida optimizada para acceso rápido en escritorio y móvil.",
        "ideationTitle": "Ideación",
        "structureTitle": "Estructura y Flujo",
        "structureItem1": "Se definió una arquitectura de contenido dividida en categorías: Clubes, Eventos y Noticias.",
        "structureItem2": "Se diseñó una interfaz basada en tarjetas para navegación intuitiva y coherencia visual.",
        "structureItem3": "Se planteó un recorrido de usuario centrado en la participación y el descubrimiento.",
        "galleryTitle": "Pantallas del Proyecto",
        "homeTitle": "Página Principal",
        "championshipTitle": "Página del Campeonato",
        "clubsTitle": "Página de Clubes",
        "mobileTitle": "Vista Móvil",
        "challengesTitle": "Retos y Aprendizajes",
        "challengesDescription": "Desarrollar una plataforma que se sintiera tanto corporativa como centrada en las personas fue un desafío clave. A través de este proyecto aprendí a alinear los principios de UX/UI con la identidad institucional manteniendo un tono cercano que fomenta la colaboración.",
        "challengeItem1": "Equilibrar accesibilidad e identidad visual para una marca bancaria.",
        "challengeItem2": "Las pruebas con usuarios reales de distintos departamentos mejoraron la adopción del producto.",
        "challengeItem3": "La gestión del despliegue y mantenimiento en Firebase fortaleció mi flujo de trabajo full-stack.",
        "nextStepsTitle": "Próximos Pasos",
        "nextStep1": "Integrar funciones de inicio de sesión y personalización.",
        "nextStep2": "Ampliar el contenido para incluir nuevos tipos de actividades y departamentos.",
        "nextStep3": "Implementar métricas para medir participación y compromiso.",
        "nextStep4": "Lanzamiento de una plataforma interna accesible y adaptable.",
        "projects": "Proyectos"
    },
    "dto": {
        "title": "DTO | Mateo Bonilla",
        "projectTitle": "Dragon Trade Off (DTO)",
        "categoryTitle": "CATEGORÍA",
        "category1": "Desarrollo Web",
        "category2": "Comercio Electrónico",
        "category3": "Diseño UX/UI",
        "yearTitle": "AÑO",
        "clientTitle": "CLIENTE",
        "client": "Proyecto Universitario",
        "description1": "Dragon Trade Off (DTO) es una plataforma de comercio electrónico creada para que los estudiantes universitarios muestren, promocionen y gestionen sus emprendimientos. Permite un acceso sencillo para los compradores y admite pagos digitales o presenciales.",
        "description2": "Tecnologías: React, TypeScript/JavaScript, HTML5, CSS, MongoDB; desplegado en Heroku.",
        "toolsTitle": "Tecnologías y Herramientas",
        "objectivesTitle": "Objetivos del Proyecto",
        "objective1": {
            "title": "Propósito",
            "item1": "Crear un mercado digital accesible para los emprendimientos estudiantiles.",
            "item2": "Fomentar el emprendimiento y la colaboración entre estudiantes.",
            "item3": "Promover la innovación local mediante una plataforma educativa."
        },
        "objective2": {
            "title": "Investigación",
            "item1": "Identificar los problemas al promocionar negocios gestionados por estudiantes.",
            "item2": "Estudiar patrones de usabilidad para transacciones simples y seguras.",
            "item3": "Analizar jerarquía visual y factores de confianza en interfaces de comercio electrónico."
        },
        "objective3": {
            "title": "Impacto",
            "item1": "Facilitar la actividad económica y visibilidad entre los estudiantes.",
            "item2": "Empoderar a los emprendedores estudiantiles mediante una presencia digital.",
            "item3": "Proporcionar experiencia real en la gestión de ventas en línea."
        },
        "designProcessTitle": "Proceso de Diseño",
        "researchTitle": "Investigación",
        "keyFindingsTitle": "Hallazgos Clave",
        "keyFinding1": "Los estudiantes necesitaban una forma sencilla de mostrar sus productos en línea.",
        "keyFinding2": "Las opciones de pago y comunicación debían ser flexibles.",
        "keyFinding3": "La confianza y la usabilidad eran factores esenciales para el compromiso del usuario.",
        "methodologyTitle": "Metodología",
        "methodology": "Encuestas, análisis competitivo y prototipado",
        "stat1": "Respuestas de estudiantes",
        "stat2": "Usuarios de prueba para validación de usabilidad",
        "stat3": "Iteraciones antes del lanzamiento final",
        "definitionTitle": "Definición",
        "projectConceptTitle": "El Proyecto",
        "projectConceptItem1": "Aplicación web de comercio electrónico para emprendedores estudiantiles.",
        "projectConceptItem2": "Permite comunicación directa entre compradores y vendedores.",
        "projectConceptItem3": "Interfaz adaptable con filtros por categorías.",
        "ideationTitle": "Ideación",
        "storyTitle": "Experiencia de Usuario y Flujo",
        "storyItem1": "Diseño de navegación simple que enfatiza la facilidad de descubrimiento.",
        "storyItem2": "Creación de una jerarquía visual que resalta los productos de los usuarios.",
        "resultsTitle": "Resultados",
        "resultsDescription": "DTO logró conectar a estudiantes y compradores locales mediante una plataforma digital intuitiva, brindándoles la capacidad de gestionar sus negocios de manera independiente.",
        "resultItem1": "Prototipo funcional de mercado en línea.",
        "resultItem2": "Integración con MongoDB para gestión de usuarios y productos.",
        "resultItem3": "Mejoras en usabilidad y confianza basadas en retroalimentación de usuarios.",
        "challengesTitle": "Retos y Aprendizajes",
        "challengesDescription": "Crear una plataforma de comercio electrónico desde cero implicó equilibrar el diseño de interfaz, las conexiones de backend y la funcionalidad adaptable. El proyecto fortaleció mis habilidades en integración de bases de datos, validación UX y diseño iterativo.",
        "challengeItem1": "Diseñar una presentación de productos moderna e intuitiva.",
        "challengeItem2": "Garantizar la adaptabilidad en distintos dispositivos y navegadores.",
        "challengeItem3": "Gestionar eficazmente los datos dinámicos provenientes de MongoDB.",
        "nextStepsTitle": "Próximos Pasos",
        "nextStep1": "Agregar pasarelas de pago integradas (PayPal, Stripe).",
        "nextStep2": "Implementar autenticación segura y paneles de usuario.",
        "nextStep3": "Desplegar una versión de producción con backend completo.",
        "projects": "Proyectos"
    },
    "sirenas": {
        "title": "Sirenas | Mateo Bonilla",
        "projectTitle": "Sirenas - Video Motion",
        "categoryTitle": "CATEGORÍA",
        "category1": "Motion Graphics",
        "category2": "Animación",
        "category3": "Visualización Musical",
        "yearTitle": "AÑO",
        "clientTitle": "PROYECTO",
        "client": "Personal",
        "description1": "\"Sirenas\" es un video motion graphics creado como una interpretación visual de la canción de Taburete. El proyecto busca representar la intensidad emocional, el ritmo y la narrativa de la letra mediante animación abstracta y transiciones sincronizadas.",
        "description2": "Diseñado y animado con Adobe After Effects e Illustrator, el proyecto experimenta con el movimiento de formas, la tipografía y la composición dinámica para evocar las sensaciones de la canción.",
        "viewVideo": "Ver Video",
        "toolsTitle": "Tecnologías y Herramientas",
        "objectivesTitle": "Objetivos del Proyecto",
        "objective1": {
            "title": "Concepto",
            "item1": "Traducir la emoción de la canción “Sirenas” en una narrativa visual.",
            "item2": "Experimentar con ritmo, color y tipografía para representar la letra.",
            "item3": "Crear una pieza donde el sonido y la imagen se fusionen en una historia coherente."
        },
        "objective2": {
            "title": "Diseño",
            "item1": "Desarrollar composiciones visuales minimalistas alineadas con el tono de la canción.",
            "item2": "Sincronizar el tiempo de animación con precisión a los ritmos musicales.",
            "item3": "Usar formas vectoriales y trayectorias de movimiento para lograr fluidez visual."
        },
        "objective3": {
            "title": "Resultado",
            "item1": "Producir un video motion graphics completo sincronizado con el audio.",
            "item2": "Expresar emociones visuales mediante abstracción en lugar de narrativa literal.",
            "item3": "Mejorar técnicas de narrativa visual a través de la interpretación musical."
        },
        "designProcessTitle": "Proceso de Diseño",
        "researchTitle": "Investigación",
        "keyFindingsTitle": "Hallazgos Clave",
        "keyFinding1": "La canción evoca una dualidad entre calma e intensidad, como olas y sirenas.",
        "keyFinding2": "El ritmo visual debe reflejar tanto el tempo musical como la emoción lírica.",
        "keyFinding3": "El color y el movimiento pueden transmitir transiciones emocionales mejor que las imágenes literales.",
        "methodologyTitle": "Metodología",
        "methodology": "Análisis musical · Storyboard · Pruebas de animación",
        "definitionTitle": "Definición",
        "projectConceptTitle": "El Proyecto",
        "projectConceptItem1": "Video motion graphics sincronizado con el ritmo y mensaje de “Sirenas”.",
        "projectConceptItem2": "Cada segmento de la animación representa una etapa emocional de la canción.",
        "projectConceptItem3": "Las formas abstractas sustituyen las imágenes literales para centrarse en la emoción y el ritmo.",
        "ideationTitle": "Ideación",
        "storyTitle": "Armonía Visual y Sonora",
        "storyItem1": "Diseño de golpes visuales que acompañan cambios de tempo.",
        "storyItem2": "Transiciones de paleta de color que reflejan dinámicas emocionales.",
        "storyItem3": "Uso de movimiento de partículas y formas ondulantes para crear atmósfera.",
        "resultsTitle": "Resultados",
        "resultsDescription": "El video final captura la esencia de “Sirenas” mediante color, ritmo y animación abstracta. Visualiza el sonido y la emoción como una narrativa continua, sincronizando cada golpe y letra con el movimiento.",
        "resultItem1": "Video motion completo sincronizado con la canción original.",
        "resultItem2": "Narrativa abstracta a través de luz, ritmo y movimiento.",
        "resultItem3": "Mejoras en técnicas de edición, sincronización y timing de animación.",
        "challengesTitle": "Retos y Aprendizajes",
        "challengesDescription": "El mayor desafío fue traducir el sonido en ritmo visual. Requirió un análisis profundo de la pista, sincronizar fotogramas con precisión y equilibrar abstracción con significado. El proceso fortaleció mis habilidades en motion design y sensibilidad temporal.",
        "challengeItem1": "Sincronizar fotogramas clave y capas de audio con precisión.",
        "challengeItem2": "Mantener coherencia emocional usando visuales abstractos.",
        "challengeItem3": "Gestionar el rendimiento de render para animaciones de alta resolución.",
        "nextStepsTitle": "Próximos Pasos",
        "nextStep1": "Desarrollar nuevas visualizaciones musicales en otros géneros.",
        "nextStep2": "Integrar motion 3D y sistemas de partículas para mayor profundidad.",
        "nextStep3": "Colaborar con músicos para videoclips oficiales.",
        "projects": "Proyectos"
    },
    "alpina": {
        "title": "Alpina | Mateo Bonilla",
        "projectTitle": "Alpina - Diseño de Stand Modular",
        "categoryTitle": "CATEGORÍA",
        "category1": "Diseño de Marca",
        "category2": "Experiencia Interactiva",
        "category3": "Visualización 3D",
        "yearTitle": "AÑO",
        "clientTitle": "CLIENTE",
        "client": "Avena Alpina",
        "description1": "Diseño de stand modular creado para la campaña promocional “Mundozarella” de Alpina. El proyecto buscó exhibir dos tipos de queso especial a través de una experiencia de marca dinámica e interactiva, combinando diseño físico con simulación digital.",
        "description2": "Herramientas: Unity (simulación y renderizado 3D), Adobe Illustrator (concepto visual y diseño de layout).",
        "toolsTitle": "Tecnologías y Herramientas",
        "objectivesTitle": "Objetivos del Proyecto",
        "objective1": {
            "title": "Concepto",
            "item1": "Diseñar una experiencia inmersiva alineada con la identidad visual de Alpina.",
            "item2": "Resaltar la singularidad de cada queso a través del contraste visual y espacial.",
            "item3": "Fomentar la participación del público mediante espacios modulares interactivos."
        },
        "objective2": {
            "title": "Diseño",
            "item1": "Desarrollar modelos 3D que simulen materiales, iluminación y estructura.",
            "item2": "Diseñar paneles modulares adaptables a diferentes ferias y espacios.",
            "item3": "Integrar texturas y colores inspirados en el empaque del producto."
        },
        "objective3": {
            "title": "Resultado",
            "item1": "Crear un prototipo 3D funcional y visualmente coherente.",
            "item2": "Simular un entorno real de exhibición dentro de Unity.",
            "item3": "Entregar un render digital que muestre la perspectiva y flujo del usuario."
        },
        "designProcessTitle": "Proceso de Diseño",
        "researchTitle": "Investigación",
        "keyFindingsTitle": "Hallazgos Clave",
        "keyFinding1": "Los usuarios se sienten más atraídos por experiencias táctiles y sensoriales durante los eventos.",
        "keyFinding2": "Un enfoque modular aumenta la versatilidad de la marca en distintas ferias.",
        "keyFinding3": "La iluminación y los acabados de materiales influyen fuertemente en la percepción de calidad del producto.",
        "ideationTitle": "Ideación",
        "storyTitle": "Desarrollo del Concepto",
        "storyItem1": "Dos mundos — cada uno representando un tipo de queso — se unen bajo una misma estructura.",
        "storyItem2": "Los colores y formas reflejan el contraste entre frescura e intensidad.",
        "storyItem3": "Elementos interactivos simulan texturas y sabores a través de luz y movimiento.",
        "resultsTitle": "Resultados",
        "resultsDescription": "El stand modular final integra exitosamente narrativa de marca, interactividad y eficiencia estructural. Mediante simulación digital y estudios de factibilidad, el concepto une funcionalidad y experiencia del usuario.",
        "resultItem1": "Prototipo del stand renderizado en Unity con mapeo completo de materiales.",
        "resultItem2": "Diseño espacial adaptable a diferentes entornos comerciales o ferias.",
        "resultItem3": "Simulación de iluminación dinámica que mejora la percepción del flujo del visitante.",
        "challengesTitle": "Retos y Aprendizajes",
        "challengesDescription": "El proyecto me retó a unir el marketing de producto con la narrativa espacial. Crear un diseño coherente, funcional y atractivo exigió iteración, pruebas y adaptación constante.",
        "challengeItem1": "Equilibrar la estética con la funcionalidad modular.",
        "challengeItem2": "Simular iluminación realista en Unity para entornos de exhibición.",
        "challengeItem3": "Coordinar texturas y materiales en armonía con la psicología del color de la marca.",
        "nextStepsTitle": "Próximos Pasos",
        "nextStep1": "Desarrollar nuevas versiones del stand para otras líneas de producto.",
        "nextStep2": "Incorporar pantallas interactivas y experiencias de producto en realidad aumentada.",
        "nextStep3": "Prototipar físicamente el stand para pruebas reales en ferias.",
        "projects": "Proyectos"
    },
    "foto": {
        "title": "¿Qué Queda Después del Amor? | Mateo Bonilla",
        "coverTitle": "¿Qué Queda Después del Amor?",
        "projectTitle": "¿Qué Queda Después del Amor?",
        "categoryTitle": "CATEGORÍA",
        "category1": "Fotografía",
        "category2": "Blanco y Negro",
        "category3": "Autorretrato",
        "yearTitle": "AÑO",
        "description1": "Proyecto fotográfico conceptual de autorretrato que explora el paisaje emocional después del amor y la pérdida. A través de imágenes monocromáticas, busca expresar la fragilidad, la resiliencia y la fuerza silenciosa que habita en la vulnerabilidad.",
        "description2": "Herramientas: Cámara Canon EOS Rebel T7; edición y postproducción en Adobe Photoshop.",
        "objectivesTitle": "Objetivos del Proyecto",
        "objective1": {
            "title": "Concepto",
            "item1": "Capturar el estado emocional tras la pérdida a través de la fotografía.",
            "item2": "Usar la luz y la sombra como símbolos de dualidad emocional.",
            "item3": "Explorar la introspección y la transformación mediante el autorretrato."
        },
        "objective2": {
            "title": "Estética",
            "item1": "Utilizar la fotografía en blanco y negro para eliminar distracciones y enfocarse en la emoción.",
            "item2": "Componer cada imagen para evocar equilibrio entre ausencia y presencia.",
            "item3": "Integrar simbolismo y minimalismo en cada composición."
        },
        "objective3": {
            "title": "Narrativa",
            "item1": "Traducir el duelo y la autorreflexión en narrativa visual.",
            "item2": "Resaltar la textura y el silencio como elementos emocionales.",
            "item3": "Invitar al espectador a encontrar su propio significado en cada imagen."
        },
        "designProcessTitle": "Proceso Creativo",
        "researchTitle": "Investigación y Planificación",
        "keyFindingsTitle": "Reflexiones Conceptuales",
        "keyFinding1": "La fotografía puede documentar tanto la emoción como la realidad.",
        "keyFinding2": "El contraste y la composición pueden expresar lo que las palabras no logran.",
        "keyFinding3": "El silencio y el vacío pueden tener tanto peso emocional como la acción.",
        "resultsTitle": "Galería",
        "resultsDescription": "Un ensayo visual contado a través de autorretratos que capturan el después del amor — la tensión entre el recuerdo y el desprendimiento. Cada imagen refleja un intento por comprender qué queda cuando el amor se desvanece.",
        "challengesTitle": "Retos y Aprendizajes",
        "challengesDescription": "El proceso fue profundamente personal. Trabajar con autorretratos exigió apertura emocional y precisión técnica. El reto fue mantener la autenticidad sin perder la coherencia narrativa.",
        "challengeItem1": "Equilibrar la vulnerabilidad emocional con el control artístico.",
        "challengeItem2": "Capturar transiciones de luz natural en espacios interiores.",
        "challengeItem3": "Crear ritmo visual entre múltiples composiciones.",
        "nextStepsTitle": "Próximos Pasos",
        "nextStep1": "Ampliar el proyecto en una serie fotográfica impresa.",
        "nextStep2": "Experimentar con fotografía análoga y texturas de grano natural.",
        "nextStep3": "Explorar exhibiciones colectivas sobre identidad emocional y autopercepción.",
        "projects": "Proyectos"
    }
}