{
    "nav": {
        "home": "Home",
        "resume": "Resume",
        "services": "Services",
        "portfolio": "Portfolio",
        "contact": "Contact"
    },
    "header": {
        "title": "NITE",
        "subtitle": "Front-End Developer/Designer | Game Developer | UX/UI Designer"
    },
    "about": {
        "who": "Who am I?",
        "located": "A Web Designer/Developer Located in Ecuador",
        "goal": "My main professional goal is to provide the best, highest-quality solution.",
        "download": "Download My CV",
        "personal": "Personal Info",
        "expertise": "My Expertise",
        "ux": "UX Design",
        "uxsub": "Interaction, Simplicity, Intuitiveness.",
        "web": "Web Development",
        "websub": "Websites, Web Apps, Mobile Apps.",
        "game": "Game Development",
        "gamesub": "Game Development, Level Design, Game Art."
    },
    "resume": {
        "title": "Mateo Bonilla | Resume",
        "name": "Mateo Bonilla",
        "subtitle": "Front-End Developer/Designer | Game Developer | UX/UI Designer",
        "brandSubtitle": "Web Designer | Game Developer | Graphic Designer",
        "my": "My",
        "titleSection": "Resume",
        "expertise": "Expertise",
        "frontendTitle": "Front-End Developer",
        "frontendDesc": "Expert in creating responsive, user-friendly web interfaces using modern frameworks such as React and Angular. Skilled in HTML, CSS, and JavaScript. Strong focus on accessibility, performance optimization, and seamless user experiences.",
        "gameTitle": "Game Development",
        "gameDesc": "Experienced in programming gameplay mechanics and interactive systems using Unity (C#). Proficient in designing intuitive UI/UX and player feedback systems.",
        "uxTitle": "UX Designer",
        "uxDesc": "UX designer and developer for web, app, and game interfaces.",
        "education": "Education",
        "degree": "Bachelor's Degree in Interactive Design",
        "degreeDesc": "Specialized in UX design and programming for web, apps, and games.",
        "minor": "Minor in Communication Design",
        "minorDesc": "Experienced in photography, Adobe Design, and graphic design, focusing on visual storytelling and communication.",
        "highschool": "High School Diploma",
        "highschoolDesc": "Strong foundation in analytical thinking and technical skills.",
        "skills": "Skills",
        "languages": "Languages"
    },
    "services": {
        "title": "Mateo Bonilla | Services",
        "name": "Mateo Bonilla",
        "subtitle": "Front-End Developer | Game Developer | Graphic Designer",
        "brandSubtitle": "Web Designer | Game Developer | Graphic Designer",
        "my": "My",
        "titleSection": "Services",
        "webTitle": "Web Design",
        "webDesc": "Custom website design, front-end and back-end development, UX/UI design, and performance optimization. Includes e-commerce solutions, mobile-first layouts, and continuous maintenance for security and content management.",
        "gameTitle": "Game Development",
        "gameDesc": "Concept design, programming mechanics and AI, 3D modeling, animation, and sound integration. Includes quality testing, performance optimization, and publishing support for distribution and marketing.",
        "appTitle": "App Development",
        "appDesc": "UI/UX design, Android and cross-platform programming, backend API integration, and database setup. Includes testing, performance monitoring, and long-term maintenance for security and compatibility.",
        "graphicTitle": "Graphic Communication",
        "graphicDesc": "Visual identity creation (logos, brand manuals), advertising design (ads, banners), packaging design, infographics, and promotional materials for both print and digital platforms.",
        "videoTitle": "Video Editing",
        "videoDesc": "Video editing, color correction, motion graphics, sound design, and format optimization for various platforms and purposes.",
        "uxTitle": "UX Design",
        "uxDesc": "User research, wireframing, prototyping, information architecture, UI design, and usability testing for seamless user experiences.",
        "freelance": "I am available for freelance work",
        "hire": "Hire me"
    },
    "portfolio": {
        "title": "Mateo Bonilla | Portfolio",
        "name": "NITE",
        "subtitle": "Front-End Developer | Game Developer | Graphic Designer",
        "brandSubtitle": "Web Designer | Game Developer | Graphic Designer",
        "my": "My",
        "titleSection": "Portfolio",
        "filter": {
            "new": "New",
            "game": "Game",
            "web": "Web/Apps",
            "ux": "UX/UI",
            "design": "Design"
        },
        "selectDescription": "Select a category to see its description...",
        "descNew": "The latest projects added to this portfolio, covering various areas of work.",
        "descGame": "Projects developed in Unity and other engines, focused on gameplay, art, and narrative design.",
        "descWeb": "Web and mobile applications showcasing UX design and frontend development.",
        "descUx": "Projects focused on UX/UI design, prototyping, and wireframing.",
        "descDesign": "Graphic design, branding, animation, and photography projects that explore visual creativity."
    },
    "contact": {
        "title": "Mateo Bonilla | Contact",
        "name": "Mateo Bonilla",
        "subtitle": "Front-End Developer | Game Developer | Graphic Designer",
        "brandSubtitle": "Web Designer | Game Developer | Graphic Designer",
        "formTitle": "Send a Message",
        "namePlaceholder": "Name *",
        "emailPlaceholder": "Email *",
        "messagePlaceholder": "Message *",
        "sendBtn": "Send Message",
        "getInTouch": "Get in Touch",
        "phone": "Phone:",
        "country": "Country:",
        "email": "Email:",
        "modal": {
            "title": "Message Sent!",
            "text": "Your message has been sent successfully. I’ll get back to you soon.",
            "close": "Close"
        }
    },
    "fragment": {
        "title": "Fragment | Mateo Bonilla",
        "projectTitle": "Fragment - Metroidvania",
        "categoryTitle": "CATEGORY",
        "category1": "Game Development",
        "category2": "UX/UI Design",
        "category3": "Storytelling",
        "yearTitle": "YEAR",
        "clientTitle": "CLIENT",
        "client": "Indie Game",
        "description1": "Fragment is a metroidvania inspired by the theme of schizophrenia. You progress to uncover the story while interacting with various characters who challenge your identity and reveal who you may truly be.",
        "description2": "Tech & tools",
        "video": "Promotional Video",
        "menu": "Menu",
        "pause": "Pause Menu",
        "gameover": "Game Over Menu",
        "projects": "Projects",
        "objectivesTitle": "Project Objectives",
        "objective1": {
            "title": "Proposal",
            "item1": "Raise awareness about a taboo illness.",
            "item2": "Develop a project that brings visibility to the condition.",
            "item3": "Promote understanding that in some cases, people can live a normal life."
        },
        "objective2": {
            "title": "Research",
            "item1": "Identify knowledge barriers about the illness.",
            "item2": "Understand the level of awareness in specific cases.",
            "item3": "Explore how much people know about mental health conditions."
        },
        "objective3": {
            "title": "Product",
            "item1": "Design a video game that raises awareness about mental health disorders.",
            "item2": "Create gameplay focused on the illness as the main character.",
            "item3": "Combine awareness, visibility, and entertainment in a single product."
        },
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "Lack of information about mental health disorders.",
        "keyFinding2": "Social stigma or rejection towards people with mental health issues.",
        "keyFinding3": "Limited understanding and empathy toward these conditions.",
        "methodologyTitle": "Methodology",
        "methodology": "VIEDU",
        "stat1": "Responses in quantitative survey",
        "stat2": "Interviews with real users",
        "stat3": "Users who tested the demo",
        "definitionTitle": "Definition",
        "projectTitle2": "The Project",
        "projectItem1": "It has a 2D narrative focus, where the player takes the role of a protagonist with schizophrenia.",
        "projectItem2": "The main objective is to distinguish what is truly real.",
        "ideationTitle": "Ideation",
        "storyTitle": "Theme and Story",
        "storyItem1": "The main theme is the internal acceptance of schizophrenia and the search for mental balance.",
        "storyItem2": "The world represents how the main character perceives reality.",
        "designTitle": "Design",
        "designItem1": "In the design phase, I translated the defined concepts into visual and functional solutions through wireframes and an interactive prototype.",
        "sketchTitle": "Sketch",
        "sketchDescription": "Level design sketch showing structure and possible interactive elements.",
        "prototypeTitle": "Prototype",
        "resultsTitle": "Results",
        "resultsDescription": "A digital experience that allows anyone to become aware of these types of mental health conditions, learn, explore, and engage without intimidation. The game integrates mechanics, gradual education, and visibility to present these topics in an accessible, engaging, and entertaining way.",
        "resultItem1": "Complete demo of the first level of the game, including gameplay, interaction, and story.",
        "resultItem2": "Integrated narrative within secondary NPC characters.",
        "resultItem3": "Real mechanics inspired by actual mental health conditions.",
        "challengesTitle": "Challenges and Learnings",
        "challengesDescription": "This project was both rewarding and challenging. Throughout the process, it was fulfilling to see how an initial idea gradually took shape and evolved with each iteration. Observing how research, design, and development came together to create a real solution helped me strengthen my skills, apply empathy and resilience, and trust in the creative process.",
        "challengeItem1": "Working with mental health topics, although complex, can lead to interesting design ideas.",
        "challengeItem2": "Implementing mental conditions into gameplay mechanics was challenging but very enjoyable.",
        "challengeItem3": "I learned how to translate concepts and designs into functional code.",
        "nextStepsTitle": "Next Steps",
        "nextStep1": "Develop a full game exploring these topics in more depth.",
        "nextStep2": "Release the game on platforms such as Steam or Play Store.",
        "nextStep3": "Build a community to increase awareness and visibility of projects like this."
    },
    "bg": {
        "title": "Banco Guayaquil | Design Challenge",
        "projectTitle": "BG Design Challenge",
        "categoryTitle": "CATEGORY",
        "category1": "UX/UI Design",
        "category2": "Prototyping",
        "yearTitle": "YEAR",
        "clientTitle": "CLIENT",
        "client": "Banco Guayaquil",
        "description1": "Design and prototyping of a credit card application workflow for Banco Guayaquil’s mobile app, focused on improving accessibility and reducing user friction. The flow supports both current app users and new customers.",
        "description2": "Tech & Tools: Figma (Design and Prototyping).",
        "viewProject": "View Prototype",
        "objectivesTitle": "Project Objectives",
        "objective1": {
            "title": "Proposal",
            "item1": "Simplify the credit card application process.",
            "item2": "Enhance user accessibility within the banking ecosystem.",
            "item3": "Provide a seamless experience for both new and existing customers."
        },
        "objective2": {
            "title": "Research",
            "item1": "Analyze user pain points in traditional credit application flows.",
            "item2": "Identify UX gaps and opportunities for improvement.",
            "item3": "Collect qualitative insights from mobile banking users."
        },
        "objective3": {
            "title": "Product",
            "item1": "Design an intuitive, step-by-step digital flow for credit card requests.",
            "item2": "Integrate UI consistency with Banco Guayaquil’s branding.",
            "item3": "Develop a clickable prototype for usability testing."
        },
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "Complex processes for applying for a credit card.",
        "keyFinding2": "Lack of accessibility for users who are not Banco Guayaquil clients.",
        "keyFinding3": "Process available only through the web.",
        "methodologyTitle": "Methodology",
        "methodology": "Design System",
        "stat1": "Responses in quantitative survey",
        "stat2": "Interviews with real users",
        "stat3": "Users who tested the prototype",
        "definitionTitle": "Definition",
        "projectTitle2": "The Project",
        "projectItem1": "The main goal of the redesign is to create a new mobile app feature to simplify the credit card application process.",
        "projectItem2": "The new functionality must be accessible to both Banco Guayaquil clients and non-clients.",
        "ideationTitle": "Ideation",
        "storyTitle": "Concept",
        "storyItem1": "Ease of use, intuitiveness, and a friendly design.",
        "prototypeTitle": "Prototype",
        "workflowTitle": "Workflow Design",
        "workflowSubtitle": "Application Flow",
        "resultsTitle": "Results",
        "resultsDescription": "The final prototype provides a faster, more intuitive application process. Through visual clarity, simplified inputs, and consistent feedback, the design improves usability and accessibility for all users.",
        "resultItem1": "Enhanced task completion speed by 30% (based on test feedback).",
        "resultItem2": "Improved perceived trust through visual hierarchy and spacing.",
        "resultItem3": "Prototype validated with user tests and iteration cycles in Figma.",
        "challengesTitle": "Challenges and Learnings",
        "challengesDescription": "Creating a financial UX that feels human-centered was both challenging and rewarding. Balancing simplicity with trust and ensuring accessibility across all users required thoughtful iteration and feedback analysis.",
        "nextStepsTitle": "Next Steps",
        "nextStep1": "Conduct A/B testing with real users to optimize onboarding performance.",
        "nextStep2": "Extend the design system to additional product flows (loans, accounts).",
        "nextStep3": "Collaborate with developers for implementation in Banco Guayaquil’s mobile app.",
        "projects": "Projects"
    },
    "dlc": {
        "title": "DLC | Mateo Bonilla",
        "projectTitle": "Dragon Learning Center (DLC)",
        "categoryTitle": "CATEGORÍA",
        "category1": "Desarrollo de Aplicaciones",
        "category2": "Diseño UX/UI",
        "category3": "Móvil",
        "yearTitle": "AÑO",
        "clientTitle": "CLIENTE",
        "client": "Universidad San Francisco de Quito (USFQ)",
        "description1": "Dragon Learning Center es una aplicación móvil diseñada para los estudiantes de la USFQ, que permite agendar tutorías en materias específicas. Los usuarios pueden registrarse como tutores o estudiantes, revisar la disponibilidad y reservar citas fácilmente.",
        "description2": "Tecnologías utilizadas: Angular, Ionic Framework, TypeScript, SCSS, JavaScript, HTML5, Firebase (backend), Figma y Adobe Illustrator (diseño y prototipado).",
        "viewLink": "Ver en Play Store",
        "toolsTitle": "Tecnologías y Herramientas",
        "demoTitle": "Video Demostrativo",
        "mobileTitle": "Interfaz Móvil",
        "resultsTitle": "Resultados",
        "resultsDescription": "La aplicación optimizó el proceso de tutorías para los estudiantes de la USFQ, mejorando la accesibilidad, usabilidad e interacción entre tutores y alumnos. Su diseño intuitivo aumentó la participación y la colaboración académica.",
        "result1": "Los estudiantes pueden agendar y hacer seguimiento de sus sesiones desde el móvil.",
        "result2": "Los tutores gestionan su disponibilidad y materias en tiempo real.",
        "result3": "La aplicación fomenta el aprendizaje colaborativo mediante una interfaz fácil de usar.",
        "challengesTitle": "Retos y Aprendizajes",
        "challengesDescription": "Desarrollar una aplicación móvil para uso académico supuso equilibrar usabilidad, escalabilidad y accesibilidad. Este proyecto fortaleció mis habilidades en diseño basado en componentes, interfaces responsivas e integración de retroalimentación de usuarios.",
        "challenge1": "Integración de autenticación y programación en tiempo real con Firebase.",
        "challenge2": "Diseñar para estudiantes y tutores con diferentes necesidades.",
        "challenge3": "Asegurar un rendimiento fluido en dispositivos Android e iOS.",
        "nextStepsTitle": "Próximos Pasos",
        "next1": "Implementar notificaciones y recordatorios de sesiones.",
        "next2": "Agregar analíticas para medir el progreso académico.",
        "next3": "Expandir la aplicación a una versión web para mayor accesibilidad.",
        "projects": "Proyectos",
        "objectivesTitle": "Project Objectives",
        "objective1Title": "Accessibility",
        "objective1Item1": "Allow students to easily schedule tutoring sessions through a user-friendly mobile interface.",
        "objective1Item2": "Ensure all users can access the app regardless of device or technical level.",
        "objective2Title": "Efficiency",
        "objective2Item1": "Simplify the process of connecting tutors and students.",
        "objective2Item2": "Automate scheduling and notifications for both roles.",
        "objective3Title": "Community",
        "objective3Item1": "Promote academic collaboration and peer learning within the university.",
        "objective3Item2": "Create a trusted system where tutors gain visibility and credibility.",
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "Students faced difficulty finding available tutors quickly.",
        "keyFinding2": "Manual scheduling was time-consuming and often led to miscommunication.",
        "keyFinding3": "Users wanted a unified platform for tutoring management.",
        "methodologyTitle": "Methodology",
        "methodology": "Design Thinking + User Interviews",
        "definitionTitle": "Definition",
        "projectDefinition": "The Project",
        "projectItem1": "Define a simple and intuitive booking flow for both tutors and students.",
        "projectItem2": "Design clear navigation and visual hierarchy to support accessibility.",
        "ideationTitle": "Ideation",
        "storyTitle": "Concept",
        "storyItem1": "Connect learning and teaching in a single, easy-to-use app.",
        "storyItem2": "Design focused on clarity, minimal steps, and visual feedback.",
        "designTitle": "Design",
        "designItem1": "Wireframes and interactive prototypes were created in Figma to validate flows.",
        "designItem2": "User testing guided interface adjustments for usability and readability.",
        "stat1": "Responses in quantitative survey",
        "stat2": "Interviews with real users",
        "stat3": "Users who tested the app"
    },
    "survival": {
        "title": "Survival M | Mateo Bonilla",
        "projectTitle": "Survival M – 3D Survival Demo",
        "categoryTitle": "CATEGORY",
        "category1": "Game Development",
        "category2": "Unity 3D Design",
        "category3": "UX/UI Design",
        "yearTitle": "YEAR",
        "clientTitle": "CLIENT",
        "client": "Personal Project",
        "description1": "Survival M is a 3D demo created in Unity, inspired by classic Resident Evil games. Players must navigate a city overrun by zombies, manage limited resources, and survive intense encounters culminating in a final boss battle.",
        "description2": "Tech & Tools: Unity (3D development), C# (programming).",
        "videoTitle": "Demo Video",
        "objectivesTitle": "Project Objectives",
        "objective1": {
            "title": "Proposal",
            "item1": "Create a playable demo focused on survival mechanics and tension.",
            "item2": "Simulate resource management and combat under pressure.",
            "item3": "Design a cohesive visual and narrative experience for players."
        },
        "objective2": {
            "title": "Research",
            "item1": "Analyze player behavior in stress situations within survival games.",
            "item2": "Identify key factors that increase immersion and engagement."
        },
        "objective3": {
            "title": "Product",
            "item1": "Deliver a short demo with combat, inventory, and puzzle elements.",
            "item2": "Integrate a final boss fight to demonstrate game mechanics."
        },
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "Players prefer intuitive combat and exploration controls.",
        "keyFinding2": "Lighting and sound design greatly enhance atmosphere and immersion.",
        "keyFinding3": "Balancing resource scarcity increases the sense of survival and tension.",
        "methodologyTitle": "Methodology",
        "methodology": "Iterative Game Design",
        "designTitle": "Design",
        "designItem1": "During the design phase, environments, menus, and UX flows were crafted in Figma before implementation in Unity.",
        "resultsTitle": "Results",
        "resultsDescription": "A 3D demo that successfully captures the essence of classic survival horror through immersive design, challenging mechanics, and tight resource management.",
        "challengesTitle": "Challenges and Learnings",
        "challengesDescription": "This project was both challenging and rewarding. It was fascinating to observe how an initial idea evolved into a playable product through iteration and testing. I improved my understanding of game flow, difficulty balance, and environmental storytelling.",
        "challengeItem1": "Balancing gameplay difficulty while maintaining tension and player engagement.",
        "challengeItem2": "Designing realistic 3D lighting to enhance immersion and mood.",
        "challengeItem3": "Translating conceptual designs into functional code within Unity.",
        "nextStepsTitle": "Next Steps",
        "nextStep1": "Develop a longer version including new levels and story arcs.",
        "nextStep2": "Implement voice acting and more immersive sound effects.",
        "nextStep3": "Publish the full version on Steam or itch.io.",
        "projects": "Projects"
    },
    "bi": {
        "title": "BI Activate | Mateo Bonilla",
        "projectTitle": "BI Activate",
        "categoryTitle": "CATEGORY",
        "category1": "Web Development",
        "category2": "UX/UI Design",
        "category3": "Video Edition",
        "yearTitle": "YEAR",
        "clientTitle": "CLIENT",
        "client": "Banco Internacional",
        "description1": "BI Activate is a website for a banking organization designed to make collaboration easier across teams. It helps employees discover peer-led initiatives (clubs, activities, and projects), connect with each other, and join effortlessly from any area of the company.",
        "description2": "The site is hosted on Firebase and built using HTML5, SCSS, and JavaScript. Design and prototypes were created using Figma, and promotional videos were produced in Adobe After Effects.",
        "viewSite": "View the website",
        "toolsTitle": "Tech & Tools",
        "objectivesTitle": "Project Objectives",
        "objective1": {
            "title": "Purpose",
            "item1": "Create a digital space that connects employees through shared interests and internal initiatives.",
            "item2": "Strengthen Banco Internacional’s internal culture through collaboration and engagement.",
            "item3": "Encourage participation in company-led activities using a clear and accessible interface."
        },
        "objective2": {
            "title": "Research",
            "item1": "Understand communication challenges between departments.",
            "item2": "Identify what motivates employees to join internal events and clubs.",
            "item3": "Collect data to define usability goals and design priorities."
        },
        "objective3": {
            "title": "Impact",
            "item1": "Promote a stronger sense of belonging within the organization.",
            "item2": "Increase visibility and participation in community-led initiatives.",
            "item3": "Offer a platform that reflects the values of collaboration and innovation."
        },
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "Employees lacked a unified platform to connect beyond daily tasks.",
        "keyFinding2": "Internal initiatives were poorly communicated or hard to discover.",
        "keyFinding3": "There was high interest in joining clubs and events, but low visibility.",
        "methodologyTitle": "Methodology",
        "methodology": "Surveys, Interviews & Usability Testing",
        "stat1": "Responses in internal employee survey",
        "stat2": "Workshops held with different departments",
        "stat3": "Design iterations before launch",
        "definitionTitle": "Definition",
        "projectConceptTitle": "Project Concept",
        "projectConceptItem1": "Build a central digital hub where employees can explore, join, and promote internal activities.",
        "projectConceptItem2": "Encourage collaboration and recognition through visibility of peer-led initiatives.",
        "projectConceptItem3": "Create a seamless experience optimized for quick access on desktop and mobile.",
        "ideationTitle": "Ideation",
        "structureTitle": "Structure and Flow",
        "structureItem1": "Defined a content architecture divided into categories: Clubs, Events, and News.",
        "structureItem2": "Prototyped a card-based interface for easy navigation and visual consistency.",
        "structureItem3": "Designed a user journey emphasizing participation and discovery.",
        "galleryTitle": "Project Screens",
        "homeTitle": "Home Page",
        "championshipTitle": "Championship Page",
        "clubsTitle": "Clubs Page",
        "mobileTitle": "Mobile View",
        "challengesTitle": "Challenges and Learnings",
        "challengesDescription": "Developing a platform that felt both corporate and human-centered was a key challenge. Through this project I learned how to align UX/UI principles with institutional identity while maintaining an inviting tone that promotes collaboration.",
        "challengeItem1": "Balancing accessibility and visual identity for a banking brand.",
        "challengeItem2": "Testing with real users from different departments improved adoption insights.",
        "challengeItem3": "Managing deployment and maintenance through Firebase strengthened my full-stack workflow.",
        "nextStepsTitle": "Next Steps",
        "nextStep1": "Integrate login and personalization features.",
        "nextStep2": "Expand to include new activity types and departments.",
        "nextStep3": "Implement analytics to measure participation and engagement.",
        "nextStep4": "Launch of an accessible and responsive internal collaboration platform.",
        "projects": "Projects"
    },
    "dto": {
        "title": "DTO | Mateo Bonilla",
        "projectTitle": "Dragon Trade Off (DTO)",
        "categoryTitle": "CATEGORY",
        "category1": "Web Development",
        "category2": "E-commerce",
        "category3": "UX/UI Design",
        "yearTitle": "YEAR",
        "clientTitle": "CLIENT",
        "client": "University Project",
        "description1": "Dragon Trade Off (DTO) is an e-commerce platform created for university students to showcase, promote, and manage their ventures. It allows easy access for buyers and supports both digital and in-person transactions.",
        "description2": "Tech stack: React, TypeScript/JavaScript, HTML5, CSS, MongoDB; deployed on Heroku.",
        "toolsTitle": "Tech & Tools",
        "objectivesTitle": "Project Objectives",
        "objective1": {
            "title": "Purpose",
            "item1": "Create an accessible marketplace for student ventures.",
            "item2": "Encourage entrepreneurship and collaboration among students.",
            "item3": "Promote local innovation through an educational platform."
        },
        "objective2": {
            "title": "Research",
            "item1": "Identify pain points in promoting student-run businesses.",
            "item2": "Study usability patterns for simple and secure transactions.",
            "item3": "Analyze visual hierarchy and trust factors in e-commerce interfaces."
        },
        "objective3": {
            "title": "Impact",
            "item1": "Facilitate economic activity and visibility among students.",
            "item2": "Empower student entrepreneurs through digital presence.",
            "item3": "Provide real-world experience in managing online sales."
        },
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "Students needed an easy way to showcase products online.",
        "keyFinding2": "Payment and communication options had to be flexible.",
        "keyFinding3": "Trust and usability were critical for engagement.",
        "methodologyTitle": "Methodology",
        "methodology": "Surveys, Competitive Analysis & Prototyping",
        "stat1": "Student responses",
        "stat2": "Test users for usability validation",
        "stat3": "Iterations before final launch",
        "definitionTitle": "Definition",
        "projectConceptTitle": "The Project",
        "projectConceptItem1": "E-commerce web app built for student entrepreneurs.",
        "projectConceptItem2": "Provides direct communication between buyers and sellers.",
        "projectConceptItem3": "Features a responsive interface with category-based filtering.",
        "ideationTitle": "Ideation",
        "storyTitle": "User Experience & Flow",
        "storyItem1": "Designed simple navigation emphasizing discoverability.",
        "storyItem2": "Created a visual hierarchy highlighting user products.",
        "resultsTitle": "Results",
        "resultsDescription": "DTO successfully connected students and local buyers through an intuitive digital platform, empowering them to manage their businesses independently.",
        "resultItem1": "Functional online marketplace prototype.",
        "resultItem2": "Integration with MongoDB for user and product management.",
        "resultItem3": "Improved usability and trust metrics based on feedback.",
        "challengesTitle": "Challenges and Learnings",
        "challengesDescription": "Creating an e-commerce platform from scratch required balancing UI design, backend connections, and responsive functionality. The project strengthened my skills in database integration, UX validation, and iterative design.",
        "challengeItem1": "Designing a modern and intuitive product display layout.",
        "challengeItem2": "Ensuring responsiveness across devices and browsers.",
        "challengeItem3": "Managing dynamic data from MongoDB effectively.",
        "nextStepsTitle": "Next Steps",
        "nextStep1": "Add integrated payment gateways (PayPal, Stripe).",
        "nextStep2": "Implement secure authentication and user dashboards.",
        "nextStep3": "Deploy a production-ready version with full backend support.",
        "projects": "Projects"
    },
    "sirenas": {
        "title": "Sirenas | Mateo Bonilla",
        "projectTitle": "Sirenas - Motion Video",
        "categoryTitle": "CATEGORY",
        "category1": "Motion Graphics",
        "category2": "Animation",
        "category3": "Music Visualization",
        "yearTitle": "YEAR",
        "clientTitle": "PROJECT TYPE",
        "client": "Personal Project",
        "description1": "\"Sirenas\" is a motion graphics video created as a visual interpretation of the song by Taburete. The project seeks to represent the emotional intensity, rhythm, and narrative of the lyrics through abstract animation and synchronized transitions.",
        "description2": "Designed and animated using Adobe After Effects and Illustrator, the project experiments with shape motion, typography, and dynamic composition to evoke the sensations of the song.",
        "viewVideo": "Watch Video",
        "toolsTitle": "Tech & Tools",
        "objectivesTitle": "Project Objectives",
        "objective1": {
            "title": "Concept",
            "item1": "Translate the emotion of the song “Sirenas” into a visual narrative.",
            "item2": "Experiment with rhythm, color, and typography to represent the lyrics.",
            "item3": "Create a piece where sound and image merge into one cohesive story."
        },
        "objective2": {
            "title": "Design",
            "item1": "Develop minimalist visual compositions aligned with the song’s mood.",
            "item2": "Synchronize animation timing precisely with musical cues.",
            "item3": "Use vector shapes and motion paths to create visual flow."
        },
        "objective3": {
            "title": "Outcome",
            "item1": "Produce a complete motion graphics video synchronized with audio.",
            "item2": "Express visual emotion through abstraction rather than literal storytelling.",
            "item3": "Enhance visual storytelling techniques through music interpretation."
        },
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "The song evokes a duality between calm and intensity, like waves and sirens.",
        "keyFinding2": "Visual rhythm must reflect both musical tempo and lyrical emotion.",
        "keyFinding3": "Color and motion can convey emotional transitions better than literal imagery.",
        "methodologyTitle": "Methodology",
        "methodology": "Music Analysis · Storyboard · Animation Tests",
        "definitionTitle": "Definition",
        "projectConceptTitle": "The Project",
        "projectConceptItem1": "A motion graphics video synchronized to the rhythm and message of “Sirenas”.",
        "projectConceptItem2": "Each segment of the animation represents an emotional stage of the song.",
        "projectConceptItem3": "Abstract shapes replace literal visuals to focus on feeling and rhythm.",
        "ideationTitle": "Ideation",
        "storyTitle": "Visual and Sound Harmony",
        "storyItem1": "Design of visual beats matching tempo changes.",
        "storyItem2": "Color palette transitions reflecting emotional dynamics.",
        "storyItem3": "Use of particle motion and wave-like shapes for atmosphere.",
        "resultsTitle": "Results",
        "resultsDescription": "The final video captures the essence of “Sirenas” through color, rhythm, and abstract animation. It visualizes sound and emotion as one continuous narrative, synchronizing every beat and lyric with motion.",
        "resultItem1": "Complete motion video synced with the original song.",
        "resultItem2": "Abstract storytelling through light, rhythm, and motion.",
        "resultItem3": "Enhanced timing, editing, and motion synchronization techniques.",
        "challengesTitle": "Challenges and Learnings",
        "challengesDescription": "The most challenging part was translating sound into visual rhythm. It required deep analysis of the track, synchronizing frames precisely with beats, and balancing abstraction with meaning. The process refined my motion design skills and timing sense.",
        "challengeItem1": "Synchronizing keyframes and audio layers precisely.",
        "challengeItem2": "Maintaining emotional coherence while using abstract visuals.",
        "challengeItem3": "Managing render performance for high-resolution animation.",
        "nextStepsTitle": "Next Steps",
        "nextStep1": "Develop additional music visualizations exploring other genres.",
        "nextStep2": "Integrate 3D motion and particle systems for depth.",
        "nextStep3": "Collaborate with musicians for official music videos.",
        "projects": "Projects"
    },
    "alpina": {
        "title": "Alpina | Mateo Bonilla",
        "projectTitle": "Alpina - Modular Booth Design",
        "categoryTitle": "CATEGORY",
        "category1": "Brand Design",
        "category2": "Interactive Experience",
        "category3": "3D Visualization",
        "yearTitle": "YEAR",
        "clientTitle": "CLIENT",
        "client": "Avena Alpina",
        "description1": "Modular booth design created for Alpina’s “Mundozarella” promotional campaign. The project aimed to showcase two specialty cheese products through a dynamic and interactive brand experience, combining physical design with digital simulation.",
        "description2": "Tools: Unity (3D simulation and rendering), Adobe Illustrator (visual concept and layout design).",
        "toolsTitle": "Tech & Tools",
        "objectivesTitle": "Project Objectives",
        "objective1": {
            "title": "Concept",
            "item1": "Design an immersive booth experience aligned with Alpina’s brand identity.",
            "item2": "Highlight the uniqueness of each cheese through visual and spatial contrast.",
            "item3": "Encourage visitor participation and interaction with modular spaces."
        },
        "objective2": {
            "title": "Design",
            "item1": "Develop 3D models simulating materials, lighting, and structure.",
            "item2": "Design modular panels adaptable for different events and spaces.",
            "item3": "Integrate textures and colors inspired by the product’s packaging."
        },
        "objective3": {
            "title": "Outcome",
            "item1": "Create a functional, visually cohesive 3D prototype.",
            "item2": "Simulate a real exhibition environment in Unity.",
            "item3": "Deliver a digital render showcasing user perspective and flow."
        },
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "Users are more attracted to tactile and sensory experiences during events.",
        "keyFinding2": "A modular approach increases brand versatility across different fairs.",
        "keyFinding3": "Lighting and material finishes heavily influence perception of product quality.",
        "ideationTitle": "Ideation",
        "storyTitle": "Concept Development",
        "storyItem1": "Two worlds — each representing a unique cheese — converge under the same structure.",
        "storyItem2": "Colors and shapes mirror the contrast between freshness and intensity.",
        "storyItem3": "Interactive elements simulate product textures and flavors through light and motion.",
        "resultsTitle": "Results",
        "resultsDescription": "The final modular booth successfully integrates brand storytelling, interactivity, and structural efficiency. Through digital simulation and physical feasibility studies, the concept merges functionality with user engagement.",
        "resultItem1": "3D-rendered stand prototype in Unity with full material mapping.",
        "resultItem2": "Spatial design adaptable for various retail environments.",
        "resultItem3": "Dynamic lighting simulation enhancing user flow perception.",
        "challengesTitle": "Challenges and Learnings",
        "challengesDescription": "The project challenged me to merge product marketing with spatial storytelling. Building a coherent design that worked both visually and structurally required iteration, testing, and adaptation.",
        "challengeItem1": "Balancing aesthetics with functional design for modularity.",
        "challengeItem2": "Simulating realistic lighting within Unity for exhibition settings.",
        "challengeItem3": "Coordinating textures and materials to align with brand color psychology.",
        "nextStepsTitle": "Next Steps",
        "nextStep1": "Develop additional booth versions for other product lines.",
        "nextStep2": "Incorporate interactive screens and AR product experiences.",
        "nextStep3": "Prototype the stand physically for real trade fair testing.",
        "projects": "Projects"
    },
    "foto": {
        "title": "What Remains After Love? | Mateo Bonilla",
        "coverTitle": "What Remains After Love?",
        "projectTitle": "What Remains After Love?",
        "categoryTitle": "CATEGORY",
        "category1": "Photography",
        "category2": "Black and White",
        "category3": "Self-Portrait",
        "yearTitle": "YEAR",
        "description1": "Conceptual self-portrait project that explores the emotional landscape after love and loss. Through monochromatic imagery, it seeks to express fragility, resilience, and the quiet strength found in vulnerability.",
        "description2": "Tools: Canon EOS Rebel T7; Adobe Photoshop for post-production and tonal editing.",
        "objectivesTitle": "Project Objectives",
        "objective1": {
            "title": "Concept",
            "item1": "Capture the emotional state after loss through photography.",
            "item2": "Use light and shadow to symbolize emotional duality.",
            "item3": "Explore introspection and transformation through self-portraiture."
        },
        "objective2": {
            "title": "Aesthetics",
            "item1": "Use black and white photography to strip away distraction and focus on emotion.",
            "item2": "Compose each image to evoke balance between absence and presence.",
            "item3": "Integrate symbolism and minimalism in each frame."
        },
        "objective3": {
            "title": "Narrative",
            "item1": "Translate grief and self-reflection into visual storytelling.",
            "item2": "Emphasize texture and silence as emotional elements.",
            "item3": "Invite viewers to find personal meaning in each composition."
        },
        "designProcessTitle": "Creative Process",
        "researchTitle": "Research & Planning",
        "keyFindingsTitle": "Conceptual Insights",
        "keyFinding1": "Photography as a medium can document emotion as well as reality.",
        "keyFinding2": "Contrast and composition can express what words cannot.",
        "keyFinding3": "Silence and emptiness can carry emotional weight as strong as action.",
        "resultsTitle": "Gallery",
        "resultsDescription": "A visual essay told through self-portraits that capture emotional aftermath — the tension between memory and release. Each image reflects an attempt to understand what remains once love fades.",
        "challengesTitle": "Challenges and Learnings",
        "challengesDescription": "The process was deeply personal. Working with self-portraiture demanded emotional openness and technical precision. The challenge was to maintain authenticity while shaping a coherent visual narrative.",
        "challengeItem1": "Balancing emotional vulnerability with artistic control.",
        "challengeItem2": "Capturing natural light transitions in indoor settings.",
        "challengeItem3": "Creating rhythm across multiple compositions.",
        "nextStepsTitle": "Next Steps",
        "nextStep1": "Expand the project into a printed photography series.",
        "nextStep2": "Experiment with analog photography and natural grain textures.",
        "nextStep3": "Explore collective exhibitions on emotional identity and self-perception.",
        "projects": "Projects"
    }
}