{
    "nav": {
        "home": "Home",
        "resume": "Resume",
        "services": "Services",
        "portfolio": "Portfolio",
        "contact": "Contact"
    },
    "header": {
        "title": "NITE",
        "subtitle": "Front-End Developer/Designer | Game Developer | UX/UI Designer"
    },
    "about": {
        "who": "Who am I?",
        "located": "A Web Designer/Developer Located in Ecuador",
        "goal": "My main professional goal is to provide the best, highest-quality solution.",
        "download": "Download My CV",
        "personal": "Personal Info",
        "expertise": "My Expertise",
        "ux": "UX Design",
        "uxsub": "Interaction, Simplicity, Intuitiveness.",
        "web": "Web Development",
        "websub": "Websites, Web Apps, Mobile Apps.",
        "game": "Game Development",
        "gamesub": "Game Development, Level Design, Game Art."
    },
    "resume": {
        "title": "Mateo Bonilla | Resume",
        "name": "Mateo Bonilla",
        "subtitle": "Front-End Developer/Designer | Game Developer | UX/UI Designer",
        "brandSubtitle": "Web Designer | Game Developer | Graphic Designer",
        "my": "My",
        "titleSection": "Resume",
        "expertise": "Expertise",
        "frontendTitle": "Front-End Developer",
        "frontendDesc": "Expert in creating responsive, user-friendly web interfaces using modern frameworks such as React and Angular. Skilled in HTML, CSS, and JavaScript. Strong focus on accessibility, performance optimization, and seamless user experiences.",
        "gameTitle": "Game Development",
        "gameDesc": "Experienced in programming gameplay mechanics and interactive systems using Unity (C#). Proficient in designing intuitive UI/UX and player feedback systems.",
        "uxTitle": "UX Designer",
        "uxDesc": "UX designer and developer for web, app, and game interfaces.",
        "education": "Education",
        "degree": "Bachelor's Degree in Interactive Design",
        "degreeDesc": "Specialized in UX design and programming for web, apps, and games.",
        "minor": "Minor in Communication Design",
        "minorDesc": "Experienced in photography, Adobe Design, and graphic design, focusing on visual storytelling and communication.",
        "highschool": "High School Diploma",
        "highschoolDesc": "Strong foundation in analytical thinking and technical skills.",
        "skills": "Skills",
        "languages": "Languages"
    },
    "services": {
        "title": "Mateo Bonilla | Services",
        "name": "Mateo Bonilla",
        "subtitle": "Front-End Developer | Game Developer | Graphic Designer",
        "brandSubtitle": "Web Designer | Game Developer | Graphic Designer",
        "my": "My",
        "titleSection": "Services",
        "webTitle": "Web Design",
        "webDesc": "Custom website design, front-end and back-end development, UX/UI design, and performance optimization. Includes e-commerce solutions, mobile-first layouts, and continuous maintenance for security and content management.",
        "gameTitle": "Game Development",
        "gameDesc": "Concept design, programming mechanics and AI, 3D modeling, animation, and sound integration. Includes quality testing, performance optimization, and publishing support for distribution and marketing.",
        "appTitle": "App Development",
        "appDesc": "UI/UX design, Android and cross-platform programming, backend API integration, and database setup. Includes testing, performance monitoring, and long-term maintenance for security and compatibility.",
        "graphicTitle": "Graphic Communication",
        "graphicDesc": "Visual identity creation (logos, brand manuals), advertising design (ads, banners), packaging design, infographics, and promotional materials for both print and digital platforms.",
        "videoTitle": "Video Editing",
        "videoDesc": "Video editing, color correction, motion graphics, sound design, and format optimization for various platforms and purposes.",
        "uxTitle": "UX Design",
        "uxDesc": "User research, wireframing, prototyping, information architecture, UI design, and usability testing for seamless user experiences.",
        "freelance": "I am available for freelance work",
        "hire": "Hire me"
    },
    "portfolio": {
        "title": "Mateo Bonilla | Portfolio",
        "name": "NITE",
        "subtitle": "Front-End Developer | Game Developer | Graphic Designer",
        "brandSubtitle": "Web Designer | Game Developer | Graphic Designer",
        "my": "My",
        "titleSection": "Portfolio",
        "filter": {
            "new": "New",
            "game": "Game",
            "web": "Web/Apps",
            "ux": "UX/UI",
            "design": "Design"
        },
        "selectDescription": "Select a category to see its description...",
        "descNew": "The latest projects added to this portfolio, covering various areas of work.",
        "descGame": "Projects developed in Unity and other engines, focused on gameplay, art, and narrative design.",
        "descWeb": "Web and mobile applications showcasing UX design and frontend development.",
        "descUx": "Projects focused on UX/UI design, prototyping, and wireframing.",
        "descDesign": "Graphic design, branding, animation, and photography projects that explore visual creativity."
    },
    "contact": {
        "title": "Mateo Bonilla | Contact",
        "name": "Mateo Bonilla",
        "subtitle": "Front-End Developer | Game Developer | Graphic Designer",
        "brandSubtitle": "Web Designer | Game Developer | Graphic Designer",
        "formTitle": "Send a Message",
        "namePlaceholder": "Name *",
        "emailPlaceholder": "Email *",
        "messagePlaceholder": "Message *",
        "sendBtn": "Send Message",
        "getInTouch": "Get in Touch",
        "phone": "Phone:",
        "country": "Country:",
        "email": "Email:",
        "modal": {
            "title": "Message Sent!",
            "text": "Your message has been sent successfully. I’ll get back to you soon.",
            "close": "Close"
        }
    },
    "fragment": {
        "title": "Fragment | Mateo Bonilla",
        "projectTitle": "Fragment - Metroidvania",
        "categoryTitle": "CATEGORY",
        "category1": "Game Development",
        "category2": "UX/UI Design",
        "category3": "Storytelling",
        "yearTitle": "YEAR",
        "clientTitle": "CLIENT",
        "client": "Indie Game",
        "description1": "Fragment is a metroidvania inspired by the theme of schizophrenia. You progress to uncover the story while interacting with various characters who challenge your identity and reveal who you may truly be.",
        "description2": "Tech & tools",
        "video": "Promotional Video",
        "menu": "Menu",
        "pause": "Pause Menu",
        "gameover": "Game Over Menu",
        "projects": "Projects",
        "objectivesTitle": "Project Objectives",
        "objective1": {
            "title": "Proposal",
            "item1": "Raise awareness about a taboo illness.",
            "item2": "Develop a project that brings visibility to the condition.",
            "item3": "Promote understanding that in some cases, people can live a normal life."
        },
        "objective2": {
            "title": "Research",
            "item1": "Identify knowledge barriers about the illness.",
            "item2": "Understand the level of awareness in specific cases.",
            "item3": "Explore how much people know about mental health conditions."
        },
        "objective3": {
            "title": "Product",
            "item1": "Design a video game that raises awareness about mental health disorders.",
            "item2": "Create gameplay focused on the illness as the main character.",
            "item3": "Combine awareness, visibility, and entertainment in a single product."
        },
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "Lack of information about mental health disorders.",
        "keyFinding2": "Social stigma or rejection towards people with mental health issues.",
        "keyFinding3": "Limited understanding and empathy toward these conditions.",
        "methodologyTitle": "Methodology",
        "methodology": "VIEDU",
        "stat1": "Responses in quantitative survey",
        "stat2": "Interviews with real users",
        "stat3": "Users who tested the demo",
        "definitionTitle": "Definition",
        "projectTitle2": "The Project",
        "projectItem1": "It has a 2D narrative focus, where the player takes the role of a protagonist with schizophrenia.",
        "projectItem2": "The main objective is to distinguish what is truly real.",
        "ideationTitle": "Ideation",
        "storyTitle": "Theme and Story",
        "storyItem1": "The main theme is the internal acceptance of schizophrenia and the search for mental balance.",
        "storyItem2": "The world represents how the main character perceives reality.",
        "designTitle": "Design",
        "designItem1": "In the design phase, I translated the defined concepts into visual and functional solutions through wireframes and an interactive prototype.",
        "sketchTitle": "Sketch",
        "sketchDescription": "Level design sketch showing structure and possible interactive elements.",
        "prototypeTitle": "Prototype",
        "resultsTitle": "Results",
        "resultsDescription": "A digital experience that allows anyone to become aware of these types of mental health conditions, learn, explore, and engage without intimidation. The game integrates mechanics, gradual education, and visibility to present these topics in an accessible, engaging, and entertaining way.",
        "resultItem1": "Complete demo of the first level of the game, including gameplay, interaction, and story.",
        "resultItem2": "Integrated narrative within secondary NPC characters.",
        "resultItem3": "Real mechanics inspired by actual mental health conditions.",
        "challengesTitle": "Challenges and Learnings",
        "challengesDescription": "This project was both rewarding and challenging. Throughout the process, it was fulfilling to see how an initial idea gradually took shape and evolved with each iteration. Observing how research, design, and development came together to create a real solution helped me strengthen my skills, apply empathy and resilience, and trust in the creative process.",
        "challengeItem1": "Working with mental health topics, although complex, can lead to interesting design ideas.",
        "challengeItem2": "Implementing mental conditions into gameplay mechanics was challenging but very enjoyable.",
        "challengeItem3": "I learned how to translate concepts and designs into functional code.",
        "nextStepsTitle": "Next Steps",
        "nextStep1": "Develop a full game exploring these topics in more depth.",
        "nextStep2": "Release the game on platforms such as Steam or Play Store.",
        "nextStep3": "Build a community to increase awareness and visibility of projects like this."
    },
    "bg": {
        "title": "Banco Guayaquil | Design Challenge",
        "projectTitle": "BG Design Challenge",
        "categoryTitle": "CATEGORY",
        "category1": "UX/UI Design",
        "category2": "Prototyping",
        "yearTitle": "YEAR",
        "clientTitle": "CLIENT",
        "client": "Banco Guayaquil",
        "description1": "Design and prototyping of a credit card application workflow for Banco Guayaquil’s mobile app, focused on improving accessibility and reducing user friction. The flow supports both current app users and new customers.",
        "description2": "Tech & Tools: Figma (Design and Prototyping).",
        "viewProject": "View Prototype",
        "objectivesTitle": "Project Objectives",
        "objective1": {
            "title": "Proposal",
            "item1": "Simplify the credit card application process.",
            "item2": "Enhance user accessibility within the banking ecosystem.",
            "item3": "Provide a seamless experience for both new and existing customers."
        },
        "objective2": {
            "title": "Research",
            "item1": "Analyze user pain points in traditional credit application flows.",
            "item2": "Identify UX gaps and opportunities for improvement.",
            "item3": "Collect qualitative insights from mobile banking users."
        },
        "objective3": {
            "title": "Product",
            "item1": "Design an intuitive, step-by-step digital flow for credit card requests.",
            "item2": "Integrate UI consistency with Banco Guayaquil’s branding.",
            "item3": "Develop a clickable prototype for usability testing."
        },
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "Complex processes for applying for a credit card.",
        "keyFinding2": "Lack of accessibility for users who are not Banco Guayaquil clients.",
        "keyFinding3": "Process available only through the web.",
        "methodologyTitle": "Methodology",
        "methodology": "Design System",
        "stat1": "Responses in quantitative survey",
        "stat2": "Interviews with real users",
        "stat3": "Users who tested the prototype",
        "definitionTitle": "Definition",
        "projectTitle2": "The Project",
        "projectItem1": "The main goal of the redesign is to create a new mobile app feature to simplify the credit card application process.",
        "projectItem2": "The new functionality must be accessible to both Banco Guayaquil clients and non-clients.",
        "ideationTitle": "Ideation",
        "storyTitle": "Concept",
        "storyItem1": "Ease of use, intuitiveness, and a friendly design.",
        "prototypeTitle": "Prototype",
        "workflowTitle": "Workflow Design",
        "workflowSubtitle": "Application Flow",
        "resultsTitle": "Results",
        "resultsDescription": "The final prototype provides a faster, more intuitive application process. Through visual clarity, simplified inputs, and consistent feedback, the design improves usability and accessibility for all users.",
        "resultItem1": "Enhanced task completion speed by 30% (based on test feedback).",
        "resultItem2": "Improved perceived trust through visual hierarchy and spacing.",
        "resultItem3": "Prototype validated with user tests and iteration cycles in Figma.",
        "challengesTitle": "Challenges and Learnings",
        "challengesDescription": "Creating a financial UX that feels human-centered was both challenging and rewarding. Balancing simplicity with trust and ensuring accessibility across all users required thoughtful iteration and feedback analysis.",
        "nextStepsTitle": "Next Steps",
        "nextStep1": "Conduct A/B testing with real users to optimize onboarding performance.",
        "nextStep2": "Extend the design system to additional product flows (loans, accounts).",
        "nextStep3": "Collaborate with developers for implementation in Banco Guayaquil’s mobile app.",
        "projects": "Projects"
    },
    "dlc": {
        "title": "DLC | Mateo Bonilla",
        "projectTitle": "Dragon Learning Center (DLC)",
        "categoryTitle": "CATEGORÍA",
        "category1": "Desarrollo de Aplicaciones",
        "category2": "Diseño UX/UI",
        "category3": "Móvil",
        "yearTitle": "AÑO",
        "clientTitle": "CLIENTE",
        "client": "Universidad San Francisco de Quito (USFQ)",
        "description1": "Dragon Learning Center es una aplicación móvil diseñada para los estudiantes de la USFQ, que permite agendar tutorías en materias específicas. Los usuarios pueden registrarse como tutores o estudiantes, revisar la disponibilidad y reservar citas fácilmente.",
        "description2": "Tecnologías utilizadas: Angular, Ionic Framework, TypeScript, SCSS, JavaScript, HTML5, Firebase (backend), Figma y Adobe Illustrator (diseño y prototipado).",
        "viewLink": "Ver en Play Store",
        "toolsTitle": "Tecnologías y Herramientas",
        "demoTitle": "Video Demostrativo",
        "mobileTitle": "Interfaz Móvil",
        "resultsTitle": "Resultados",
        "resultsDescription": "La aplicación optimizó el proceso de tutorías para los estudiantes de la USFQ, mejorando la accesibilidad, usabilidad e interacción entre tutores y alumnos. Su diseño intuitivo aumentó la participación y la colaboración académica.",
        "result1": "Los estudiantes pueden agendar y hacer seguimiento de sus sesiones desde el móvil.",
        "result2": "Los tutores gestionan su disponibilidad y materias en tiempo real.",
        "result3": "La aplicación fomenta el aprendizaje colaborativo mediante una interfaz fácil de usar.",
        "challengesTitle": "Retos y Aprendizajes",
        "challengesDescription": "Desarrollar una aplicación móvil para uso académico supuso equilibrar usabilidad, escalabilidad y accesibilidad. Este proyecto fortaleció mis habilidades en diseño basado en componentes, interfaces responsivas e integración de retroalimentación de usuarios.",
        "challenge1": "Integración de autenticación y programación en tiempo real con Firebase.",
        "challenge2": "Diseñar para estudiantes y tutores con diferentes necesidades.",
        "challenge3": "Asegurar un rendimiento fluido en dispositivos Android e iOS.",
        "nextStepsTitle": "Próximos Pasos",
        "next1": "Implementar notificaciones y recordatorios de sesiones.",
        "next2": "Agregar analíticas para medir el progreso académico.",
        "next3": "Expandir la aplicación a una versión web para mayor accesibilidad.",
        "projects": "Proyectos",
        "objectivesTitle": "Project Objectives",
        "objective1Title": "Accessibility",
        "objective1Item1": "Allow students to easily schedule tutoring sessions through a user-friendly mobile interface.",
        "objective1Item2": "Ensure all users can access the app regardless of device or technical level.",
        "objective2Title": "Efficiency",
        "objective2Item1": "Simplify the process of connecting tutors and students.",
        "objective2Item2": "Automate scheduling and notifications for both roles.",
        "objective3Title": "Community",
        "objective3Item1": "Promote academic collaboration and peer learning within the university.",
        "objective3Item2": "Create a trusted system where tutors gain visibility and credibility.",
        "designProcessTitle": "Design Process",
        "researchTitle": "Research",
        "keyFindingsTitle": "Key Findings",
        "keyFinding1": "Students faced difficulty finding available tutors quickly.",
        "keyFinding2": "Manual scheduling was time-consuming and often led to miscommunication.",
        "keyFinding3": "Users wanted a unified platform for tutoring management.",
        "methodologyTitle": "Methodology",
        "methodology": "Design Thinking + User Interviews",
        "definitionTitle": "Definition",
        "projectDefinition": "The Project",
        "projectItem1": "Define a simple and intuitive booking flow for both tutors and students.",
        "projectItem2": "Design clear navigation and visual hierarchy to support accessibility.",
        "ideationTitle": "Ideation",
        "storyTitle": "Concept",
        "storyItem1": "Connect learning and teaching in a single, easy-to-use app.",
        "storyItem2": "Design focused on clarity, minimal steps, and visual feedback.",
        "designTitle": "Design",
        "designItem1": "Wireframes and interactive prototypes were created in Figma to validate flows.",
        "designItem2": "User testing guided interface adjustments for usability and readability.",
        "stat1": "Responses in quantitative survey",
        "stat2": "Interviews with real users",
        "stat3": "Users who tested the app"
    }
}